<a href="https://colab.research.google.com/github/iMike-505/Tratamiento-de-Datos/blob/main/TareaFinal.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **CATALOGO**

---

* ``` pclase – Tipo de Boleto, e.g 1 = 1ra, 2 = 2da, 3 = 3ra ```
* ```survival – Sí la persona sobrevivió o no el accidente (1|0) ```
* ```name – Nombre del pasajero y titulo incluido ```
* ```sex – Género del pasajero: female|male ```
* ```age – Edad en años ```
* ```sibsp – Número de parientes/cónyuges abordo del Titanic ```
* ```parch – Número de padres/hijos abordo del Titanic ```
* ```ticket – Número de Boleto ```
* ```fare – Costo del boleto ```
* ```cabin – Número cabina ```
* ```embarked – Puerto de embarcación (C = Cherburgo; Q = Queenstown; S = Southampton) ```
* ```boat - Número de bote salvavidas, si tomó alguno ```
* ```body - Número de cuerpo (si no sobrevivió y se recuperó el cuerpo) ```
* ```home.dest - Origen y destino del pasajero ```

Limpieza de datos
1. Si la edad es null (na) llenar el campo con la media de la edad (usar el método fillna())
2. Si embarqued es na llenar con S
3. Cambiar los valores alfanumericos de sex a numero usando { 'female': 1, 'male': 0 }
4. Cambiar los valores alfanumericos de embarked a numero usando { 'S': 0, 'C': 1, 'Q': 2 }
5. Crear una nueva variable llamada child con valor 1 para los pasajeros con una edad menor a 16 años y 0 si el pasajero tiene 16 años o mas
6. Eliminar las columnas ticket, cabin y sibsp
7. Validar que no existan registros duplicados
8. Listar los valores únicos del campo sex
9. Quitar los espacios vacíos de los campos que no sean numéricos
10. Cambiar los nombres de las variables a español sin espacios
11. Mostrar los estadísticos básicos de la columna edad
12. En un df nuevo dejar solo las columnas nombre, puerto de embarcación y edad de las mujeres
13. Guardar los datos limpios en un archivos json orientado a registros llamado iniciales_titanic_clean.json (sus iniciales)

14. Guardar los datos limpios en un archivo de excel con dos hojas una con los sobrevientes y otra con los fallecidos llamado iniciales_titanic_clean.xlsx (sus iniciales)

15. En la Base de datos bdcolegiosource de bd.arcelia.net escribir los datos limpios en una tabla llamada TDP_INICIALES_TITANIC (sus iniciales)

Los archivos deben ir direccionados a la raiz de colab que esto es no usar ningun directorio para guardarlos ejemplo
`df_mysql.to_csv('alumnos.csv', index=False)`
Para guardar la tabla la instrucción es parecida a la siguiente
`df_mysql.to_sql(name='OMG_Alumnos', con=conn)` #name es el nombre de tabla

In [ ]:
import pandas as pd
import numpy as np
import datetime as dt
import re
!pip install mysql-connector-python sqlalchemy
from sqlalchemy import create_engine

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.29-cp37-cp37m-manylinux1_x86_64.whl (25.2 MB)
     |████████████████████████████████| 25.2 MB 1.7 MB/s
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (1.4.37)
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.17.3)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (4.11.4)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (1.1.2)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (4.1.1)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (3.8.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.29

In [ ]:
#Lee la fuente de los datos
df = pd.read_csv('https://raw.githubusercontent.com/omarmendoza564/datos/main/datos/titanic.csv')
df.info()
df.count()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(7), object(7)
memory usage: 143.4+ KB

pclass       1309
survived     1309
name         1309
sex          1309
age          1046
sibsp        1309
parch        1309
ticket       1309
fare         1308
cabin         295
embarked     1307
boat          486
body          121
home.dest     745
dtype: int64

In [ ]:
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df = df.drop(df.index[1309]) #Usé este drop para eliminar el ultimo registro, ya que me causaba conflicto en posteriores operaciones

In [ ]:
# 1. Si la edad es null (na) llenar el campo con la media de la edad (usar el método fillna())
df[pd.isnull(df['age'])]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
15,1.0,0.0,"Baumann, Mr. John D",male,NaN,0.0,0.0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
37,1.0,1.0,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,0.0,0.0,111427,26.5500,NaN,S,9,NaN,"Los Angeles, CA"
40,1.0,0.0,"Brewe, Dr. Arthur Jackson",male,NaN,0.0,0.0,112379,39.6000,NaN,C,NaN,NaN,"Philadelphia, PA"
46,1.0,0.0,"Cairns, Mr. Alexander",male,NaN,0.0,0.0,113798,31.0000,NaN,S,NaN,NaN,NaN
59,1.0,1.0,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,NaN,0.0,0.0,17770,27.7208,NaN,C,5,NaN,"New York, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1293,3.0,0.0,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0.0,0.0,A/5 2466,8.0500,NaN,S,NaN,NaN,NaN
1297,3.0,0.0,"Wiseman, Mr. Phillippe",male,NaN,0.0,0.0,A/4. 34244,7.2500,NaN,S,NaN,NaN,NaN
1302,3.0,0.0,"Yousif, Mr. Wazli",male,NaN,0.0,0.0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3.0,0.0,"Yousseff, Mr. Gerious",male,NaN,0.0,0.0,2627,14.4583,NaN,C,NaN,NaN,NaN
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN

In [ ]:
df[pd.isnull(df['age'])]
df['age'].fillna((df['age'].mean()), inplace=True)

In [ ]:
df[pd.isnull(df['age'])]
df['age'] = df['age'].astype(int) #Checar si esta bien en cambiar el tipo de columna
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3.0,0.0,"Zabour, Miss. Hileni",female,14,1.0,0.0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3.0,0.0,"Zabour, Miss. Thamine",female,29,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [ ]:
# 2. Si embarqued es na llenar con S
df[pd.isnull(df['embarked'])]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
168,1.0,1.0,"Icard, Miss. Amelie",female,38,0.0,0.0,113572,80.0,B28,NaN,6,NaN,NaN
284,1.0,1.0,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62,0.0,0.0,113572,80.0,B28,NaN,6,NaN,"Cincinatti, OH"

In [ ]:
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [ ]:
#df["embarked"].fillna("S")
df['embarked'].fillna('S', inplace = True)
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3.0,0.0,"Zabour, Miss. Hileni",female,14,1.0,0.0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3.0,0.0,"Zabour, Miss. Thamine",female,29,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [ ]:
#Verificamos que no haya nulos
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        0
boat          823
body         1188
home.dest     564
dtype: int64

In [ ]:
#3. Cambiar los valores alfanumericos de sex a numero usando { 'female': 1, 'male': 0 }
df['sex'] = df['sex'].replace({ 'female': 1, 'male': 0 })
df['sex']

0       1
1       0
2       1
3       0
4       1
       ..
1304    1
1305    1
1306    0
1307    0
1308    0
Name: sex, Length: 1309, dtype: int64

In [ ]:
#4. Cambiar los valores alfanumericos de embarked a numero usando { 'S': 0, 'C': 1, 'Q': 2 }
df['embarked'] = df['embarked'].replace({ 'S': 0, 'C': 1, 'Q': 2 })
df['embarked']

0       0
1       0
2       0
3       0
4       0
       ..
1304    1
1305    1
1306    1
1307    1
1308    0
Name: embarked, Length: 1309, dtype: int64

In [ ]:
#5. Crear una nueva variable llamada child con valor 1 para los pasajeros con una edad menor a 16 años y 0 si el pasajero tiene 16 años o mas
df['child'] = df['age']  
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,child
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",1,29,0.0,0.0,24160,211.3375,B5,0,2,NaN,"St Louis, MO",29
1,1.0,1.0,"Allison, Master. Hudson Trevor",0,0,1.0,2.0,113781,151.5500,C22 C26,0,11,NaN,"Montreal, PQ / Chesterville, ON",0
2,1.0,0.0,"Allison, Miss. Helen Loraine",1,2,1.0,2.0,113781,151.5500,C22 C26,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",2
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",0,30,1.0,2.0,113781,151.5500,C22 C26,0,NaN,135.0,"Montreal, PQ / Chesterville, ON",30
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25,1.0,2.0,113781,151.5500,C22 C26,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",25
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3.0,0.0,"Zabour, Miss. Hileni",1,14,1.0,0.0,2665,14.4542,NaN,1,NaN,328.0,NaN,14
1305,3.0,0.0,"Zabour, Miss. Thamine",1,29,1.0,0.0,2665,14.4542,NaN,1,NaN,NaN,NaN,29
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",0,26,0.0,0.0,2656,7.2250,NaN,1,NaN,304.0,NaN,26
1307,3.0,0.0,"Zakarian, Mr. Ortin",0,27,0.0,0.0,2670,7.2250,NaN,1,NaN,NaN,NaN,27
1308,3.0,0.0,"Zimmerman, Mr. Leo",0,29,0.0,0.0,315082,7.8750,NaN,0,NaN,NaN,NaN,29

In [ ]:
df['child'] = df['child'].replace({range(0, 15): 1, range(16, 100) : 0}) 
df['child'] = df['child'].astype(int) #Para que solo se vean los 1 y 0 cambiamos el tipo de la columna
df['child']

0       0
1       1
2       1
3       0
4       0
       ..
1304    1
1305    0
1306    0
1307    0
1308    0
Name: child, Length: 1309, dtype: int64

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   int64
 4   age        1309 non-null   int64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1309 non-null   int64
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
 14  child      1309 non-null   int64
dtypes: float64(6), int64(4), object(5)
memory usage: 163.6+ KB

In [ ]:
# 6. Eliminar las columnas ticket, cabin y sibsp
df = df.drop(['ticket', 'cabin', 'sibsp'], axis=1)

In [ ]:
df

,pclass,survived,name,sex,age,parch,fare,embarked,boat,body,home.dest,child
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",1,29,0.0,211.3375,0,2,NaN,"St Louis, MO",0
1,1.0,1.0,"Allison, Master. Hudson Trevor",0,0,2.0,151.5500,0,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,1.0,0.0,"Allison, Miss. Helen Loraine",1,2,2.0,151.5500,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",1
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",0,30,2.0,151.5500,0,NaN,135.0,"Montreal, PQ / Chesterville, ON",0
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25,2.0,151.5500,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3.0,0.0,"Zabour, Miss. Hileni",1,14,0.0,14.4542,1,NaN,328.0,NaN,1
1305,3.0,0.0,"Zabour, Miss. Thamine",1,29,0.0,14.4542,1,NaN,NaN,NaN,0
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",0,26,0.0,7.2250,1,NaN,304.0,NaN,0
1307,3.0,0.0,"Zakarian, Mr. Ortin",0,27,0.0,7.2250,1,NaN,NaN,NaN,0
1308,3.0,0.0,"Zimmerman, Mr. Leo",0,29,0.0,7.8750,0,NaN,NaN,NaN,0

In [ ]:
# 7. Validar que no existan registros duplicados
df_dup = df.duplicated()
df_dup #No hay registros duplicados

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Length: 1309, dtype: bool

In [ ]:
# 8. Listar los valores únicos del campo sex
print('sex', df['sex'].unique()) #Aparece un valor NaN, es del ultimo registro hay que eliminarlo (?)

sex [1 0]

In [ ]:
# 9. Quitar los espacios vacíos de los campos que no sean numéricos
df['name'] = df['name'].str.strip()

In [ ]:
df['home.dest'] = df['home.dest'].str.strip()

In [ ]:
df

,pclass,survived,name,sex,age,parch,fare,embarked,boat,body,home.dest,child
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",1,29,0.0,211.3375,0,2,NaN,"St Louis, MO",0
1,1.0,1.0,"Allison, Master. Hudson Trevor",0,0,2.0,151.5500,0,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,1.0,0.0,"Allison, Miss. Helen Loraine",1,2,2.0,151.5500,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",1
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",0,30,2.0,151.5500,0,NaN,135.0,"Montreal, PQ / Chesterville, ON",0
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25,2.0,151.5500,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3.0,0.0,"Zabour, Miss. Hileni",1,14,0.0,14.4542,1,NaN,328.0,NaN,1
1305,3.0,0.0,"Zabour, Miss. Thamine",1,29,0.0,14.4542,1,NaN,NaN,NaN,0
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",0,26,0.0,7.2250,1,NaN,304.0,NaN,0
1307,3.0,0.0,"Zakarian, Mr. Ortin",0,27,0.0,7.2250,1,NaN,NaN,NaN,0
1308,3.0,0.0,"Zimmerman, Mr. Leo",0,29,0.0,7.8750,0,NaN,NaN,NaN,0

In [ ]:
# 10. Cambiar los nombres de las variables a español sin espacios
df.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'parch', 'fare', 'embarked',
       'boat', 'body', 'home.dest', 'child'],
      dtype='object')

In [ ]:
df.columns = ['Boleto', 'Sobrevivio', 'Nombre', 'Sexo', 'Edad', 'No.Fam', 
       'Tarifa', 'Embarque', 'Bote', 'Cuerpo', 'Destino', 'Niño']

In [ ]:
df

,Boleto,Sobrevivio,Nombre,Sexo,Edad,No.Fam,Tarifa,Embarque,Bote,Cuerpo,Destino,Niño
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",1,29,0.0,211.3375,0,2,NaN,"St Louis, MO",0
1,1.0,1.0,"Allison, Master. Hudson Trevor",0,0,2.0,151.5500,0,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,1.0,0.0,"Allison, Miss. Helen Loraine",1,2,2.0,151.5500,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",1
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",0,30,2.0,151.5500,0,NaN,135.0,"Montreal, PQ / Chesterville, ON",0
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25,2.0,151.5500,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3.0,0.0,"Zabour, Miss. Hileni",1,14,0.0,14.4542,1,NaN,328.0,NaN,1
1305,3.0,0.0,"Zabour, Miss. Thamine",1,29,0.0,14.4542,1,NaN,NaN,NaN,0
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",0,26,0.0,7.2250,1,NaN,304.0,NaN,0
1307,3.0,0.0,"Zakarian, Mr. Ortin",0,27,0.0,7.2250,1,NaN,NaN,NaN,0
1308,3.0,0.0,"Zimmerman, Mr. Leo",0,29,0.0,7.8750,0,NaN,NaN,NaN,0

In [ ]:
# 11. Mostrar los estadísticos básicos de la columna edad
df['Edad'].describe()

count    1309.000000
mean       29.685256
std        12.899824
min         0.000000
25%        22.000000
50%        29.000000
75%        35.000000
max        80.000000
Name: Edad, dtype: float64

In [ ]:
# 12. En un df nuevo dejar solo las columnas nombre, puerto de embarcación y edad de las mujeres
df_mujeres =df.copy()
df_mujeres = df_mujeres.drop(['Boleto', 'Sobrevivio', 'No.Fam', 'Tarifa', 'Bote', 'Cuerpo', 'Destino', 'Niño'], axis=1)
df_mujeres

                                               Nombre  Sexo  Edad  Embarque
0                       Allen, Miss. Elisabeth Walton     1    29         0
1                      Allison, Master. Hudson Trevor     0     0         0
2                        Allison, Miss. Helen Loraine     1     2         0
3                Allison, Mr. Hudson Joshua Creighton     0    30         0
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)     1    25         0
...                                               ...   ...   ...       ...
1304                             Zabour, Miss. Hileni     1    14         1
1305                            Zabour, Miss. Thamine     1    29         1
1306                        Zakarian, Mr. Mapriededer     0    26         1
1307                              Zakarian, Mr. Ortin     0    27         1
1308                               Zimmerman, Mr. Leo     0    29         0

[1309 rows x 4 columns]

In [ ]:
df_mujeres = df_mujeres[df_mujeres.Sexo != 0]
df_mujeres

                                               Nombre  Sexo  Edad  Embarque
0                       Allen, Miss. Elisabeth Walton     1    29         0
2                        Allison, Miss. Helen Loraine     1     2         0
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)     1    25         0
6                   Andrews, Miss. Kornelia Theodosia     1    63         0
8       Appleton, Mrs. Edward Dale (Charlotte Lamson)     1    53         0
...                                               ...   ...   ...       ...
1286  Whabee, Mrs. George Joseph (Shawneene Abi-Saab)     1    38         1
1290                 Wilkes, Mrs. James (Ellen Needs)     1    47         0
1300          Yasbeck, Mrs. Antoni (Selini Alexander)     1    15         1
1304                             Zabour, Miss. Hileni     1    14         1
1305                            Zabour, Miss. Thamine     1    29         1

[466 rows x 4 columns]

In [ ]:
# 13. Guardar los datos limpios en un archivos json orientado a registros llamado iniciales_titanic_clean.json (sus iniciales)
df.to_json('COM_titanic_clean.json', orient = "records")

In [ ]:
# 14. Guardar los datos limpios en un archivo de excel con dos hojas una con los sobrevientes y otra con los fallecidos llamado iniciales_titanic_clean.xlsx (sus iniciales)
df2 = df.copy() 
with pd.ExcelWriter('COM_titanic_clean.xlsx', index=False) as w:
  df[df.Sobrevivio != 0].to_excel(w, sheet_name="Supervivientes", index=False)
  df[df.Sobrevivio != 1].to_excel(w, sheet_name="Fallecidos", index=False)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: FutureWarning: Use of **kwargs is deprecated, use engine_kwargs instead.
  This is separate from the ipykernel package so we can avoid doing imports until

In [ ]:
# 15. En la Base de datos bdcolegiosource de bd.arcelia.net escribir los datos limpios en una tabla llamada TDP_INICIALES_TITANIC (sus iniciales)
us = 'fesalu'
passwd = 'bdfes123'
url = 'bd.arcelia.net'
puerto = '3306'
bd = 'bdcolegiosource'
auth = 'mysql_native_password'

# Iniciamos la conexión a la base de datos
str_conn = 'mysql+mysqlconnector://{0}:{1}@{2}:{3}/{4}?auth_plugin={5}'
str_conn = str_conn.format(us, passwd, url, puerto, bd, auth)
print(str_conn)

mysql+mysqlconnector://fesalu:bdfes123@bd.arcelia.net:3306/bdcolegiosource?auth_plugin=mysql_native_password

In [ ]:
#Conexión a la BD
#conn = create_engine(str_conn)

#Creación de la tabla TDP_INICIALES_TITANIC
df.to_sql("TDP_COM_TITANIC", con = create_engine(str_conn), if_exists="replace")

df_mysql = df.copy()
df_mysql.info()
df_mysql.columns

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Boleto      1309 non-null   float64
 1   Sobrevivio  1309 non-null   float64
 2   Nombre      1309 non-null   object
 3   Sexo        1309 non-null   int64
 4   Edad        1309 non-null   int64
 5   No.Fam      1309 non-null   float64
 6   Tarifa      1308 non-null   float64
 7   Embarque    1309 non-null   int64
 8   Bote        486 non-null    object
 9   Cuerpo      121 non-null    float64
 10  Destino     745 non-null    object
 11  Niño        1309 non-null   int64
dtypes: float64(5), int64(4), object(3)
memory usage: 165.2+ KB

Index(['Boleto', 'Sobrevivio', 'Nombre', 'Sexo', 'Edad', 'No.Fam', 'Tarifa',
       'Embarque', 'Bote', 'Cuerpo', 'Destino', 'Niño'],
      dtype='object')